{
	"homePage": {
		"baseSection": {
			"baseDescription": "Jestem programistą-samoukiem z pasją do cyberbezpieczeństwa, szczególnie w obszarze bezpieczeństwa aplikacji webowych. Zawsze gotowy na nowe wyzwania - im trudniejsze, tym lepsze.",
			"contactTxt": "Napisz do mnie",
			"learnMoreTxt": "Poznaj mnie"
		},
		"aboutSection": {
			"description": "Jestem webdeveloperem z doświadczeniem w SEO oraz solidną znajomością cyberbezpieczeństwa. Jeśli szukasz specjalisty, który nie tylko stworzy estetyczną i funkcjonalną stronę internetową, ale także zadba o jej bezpieczeństwo i doradzi w kwestiach SEO - skontaktuj się ze mną, a chętnie zajmę się Twoim projektem. Nieustannie rozwijam swoje umiejętności i śledzę najnowsze technologie oraz standardy internetowe. Moje podejście opiera się na wydajności, dostępności oraz pisaniu czystego, przejrzystego kodu. Cenię sobie dobrą komunikację, transparentność i długofalową współpracę z klientami. Niezależnie od tego, czy potrzebujesz kompletnej strony internetowej, czy wsparcia w wybranym obszarze - jestem gotowy, by pomóc."
		},
		"skillsSection": {
			"description": "Tworzę nowoczesne, responsywne aplikacje internetowe, dbając o czytelność kodu, wydajność i bezpieczeństwo. Sprawnie poruszam się w środowisku frontendowym i backendowym, wykorzystując sprawdzone narzędzia oraz technologie. Mam doświadczenie w pracy z systemami Linux, konteneryzacją aplikacji (Docker), automatyzacją procesów, a także optymalizacją SEO i analizą bezpieczeństwa aplikacji webowych. Stale rozwijam się w kierunku programistycznym i w obszarze cyberbezpieczeństwa, co pozwala mi tworzyć solidne, skalowalne i bezpieczne rozwiązania gotowe do wdrożenia na środowisku produkcyjnym."
		},
		"certsSection": {
			"description": "Nieustannie poszerzam swoją wiedzę jako twórca stron internetowych i pasjonat bezpieczeństwa. Wybrane kursy i certyfikaty poniżej odzwierciedlają moje zaangażowanie w rozwój i dbałość o bezpieczeństwo w dynamicznym świecie technologii."
		},
		"projectsSection": {},
		"contactSection": {}
	},
	"mainMenu": {
		"About": "About",
		"Skills": "Umiejętności",
		"Courses": "Szkolenia/certyfikaty",
		"Projects": "Projekty",
		"Blog": "Blog",
		"Contact": "Kontakt",
		"Resume": "CV"
	},
	"projectDetailsPage": {},
	"contactForm": {}
}
